tests/TestCompose_nutils-of/referenceOutput/OpenFOAM/system/preciceDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      preciceDict;
}

preciceConfig "configs/precice-config.xml";

participant OpenFOAM;

modules (CHT);

interfaces
{
  Interface1
  {
    mesh              OpenFOAM-Mesh;
    patches           (interface);
    
    readData
    (
      Heat-Flux
    );
    
    writeData
    (
      Temperature
    );
  };
};